---
kind: other
id: Properties.T:Autodesk.Revit.DB.KeyBasedTreeEntriesIterator
source: html/bffd2a46-6b56-bdbd-1097-c21ab90332e1.htm
---
# KeyBasedTreeEntriesIterator Properties

Gets the item at the current position of the iterator.